//  Напишите программу, которая на вход принимает два числа и 
//  выдаёт, какое число большее, а какое меньшее.
// a = 5; b = 7 -> max = 7
// a = 2 b = 10 -> max = 10
// a = -9 b = -3 -> max = -3

// Console.WriteLine("Введите число");
// int a=Convert.ToInt32(Console.ReadLine());

// Console.WriteLine("Введите число");
// int b=Convert.ToInt32(Console.ReadLine());

// if ( a>b )
// {
//     Console.WriteLine("Число [a] больше чем [b]");
// }
// else if (a==b)
// {
//     Console.WriteLine("Число [a] равно [b]");
// }
// else
// {
//     Console.WriteLine("Число [b] больше чем [a]");
// }


//  Напишите программу, которая принимает на вход три числа и 
//  выдаёт максимальное из этих чисел.
// 2, 3, 7 -> 7
// 44 5 78 -> 78
// 22 3 9 -> 22


// Console.WriteLine("Введите число");
// int number1=Convert.ToInt32(Console.ReadLine());

// Console.WriteLine("Введите число");
// int number2=Convert.ToInt32(Console.ReadLine());

// Console.WriteLine("Введите число");
// int number3=Convert.ToInt32(Console.ReadLine());

// if (number1 > number2)
// {
//     if (number1 > number3)
//     {
//         Console.WriteLine("Максимальное число: " + number1);
//     }
//     else
//     {
//         Console.WriteLine("Максимальное число: " + number3);
//     }
// }

// else if (number2 > number3)
// {
//     Console.WriteLine("Максимальное число: " + number2);
// }
// else
// {
//     Console.WriteLine("Максимальное число: " + number3);
// }


//  Напишите программу, которая на вход принимает число и 
//  выдаёт, является ли число чётным (делится ли оно на два без остатка).
// 4 -> да
// -3 -> нет
// 7 -> нет

// Console.Write("Введите число: ");
// int number = Convert.ToInt32(Console.ReadLine ());

// if (number % 2 == 0)
// {
//     Console.WriteLine("Да");
// }
// else
// {
//    Console.WriteLine("Нет");
// }
